[
    {
        "country_code": "DE",
        "review": "don't waste your time with this courses, you will never find a job, even Le wagon wont hire you, this is just a business for them, at the end of the day, companies need people with experience, and they dont even teach required frameworks",
        "date": "25. November 2023"
    },
    {
        "country_code": "DE",
        "review": "LE WAGON: A HARROWING EXPERIENCE AND A TRUE NIGHTMARE\nMy journey with Le Wagon has been SO DISAPPOINTING that I feel the OBLIGATION to share my experience to prevent others from falling into the same trap. The SHOCKING news of the CANCELLATION of the bootcamp just five days before its scheduled start, due to only having two participants, marked the beginning of a series of OVERWHELMING problems.\nDuring the registration process, I found myself dealing with MORE THAN SIX INDIVIDUALS, and to make matters worse, I had to REPEAT the application process two or three times. The INEFFICIENCY of their communication system between the branches in Spain and Germany is UNACCEPTABLE and has added an extra layer of FRUSTRATION.\nIn my struggle to obtain the GOVERNMENT VOUCHER, I faced more obstacles. The agent expressed DOUBTS about the RELIABILITY of Le Wagon, which only HEIGHTENED MY CONCERNS. The POSITIVE REVIEWS on their website do not reveal the DARK REALITY of the issues Le Wagon is facing. The LACK OF PROFESSIONALISM is evident, with people DISAPPEARING overnight, supposedly in \"VACATION MODE.\" Additionally, they CHANGED the sales representative repeatedly during my process, causing CONFUSION and DISTRUST.\nTo add INSULT TO INJURY, the Data Analyst course, which costs a STAGGERING 8500 EUROS, left me QUESTIONING ITS VALUE. After READING and CONTACTING former students, it became apparent that completing the course doesn't necessarily leave you as prepared as you might believe. Moreover, the ACTUAL EMPLOYMENT RATE is not accurately reflected on the website, as the INTERVIEWER candidly revealed that many students either LEAVE the course or pursue it for PERSONAL ENRICHMENT rather than seeking employment in the field.\nI made the PAINFUL DECISION not to continue with Le Wagon, losing TIME, MONEY, and even having to CUT SHORT my family vacation to attend this course. In summary, from START TO FINISH, my experience with Le Wagon has been a DISASTER. I cannot RECOMMEND this company to anyone and STRONGLY ADVISE reconsidering any plans to join them. A true NIGHTMARE that I deeply regret having lived through!",
        "date": "12. Januar 2024"
    },
    {
        "country_code": "DE",
        "review": "I did the Part-time Data Science online bootcamp from Le Wagon in 2023. \nLet me start with the application process: Everything worked well, they contacted me, I had a quick interview about my prior career and motivation. After that I had to do a little assessment. Nothing complicated. I got accepted and had to pay the fee of about 8.5K Euros. \nThe pre-bootcamp was pretty unnecessary to my eyes as all of that stuff was collected from different free web pages, it was very much but most of the stuff was not needed during the bootcamp as it was covered again or not covered at all. The good thing was you could just check it as done because most of that stuff was not new to me.\nLet's start with the actual bootcamp: The first day was all about getting to know the other participants and preparing the Laptop/PC for the BC. Most of the stuff went through, they had a good and detailed instruction on github, however, some crucial points were missing (e.g. there were some errors occuring while setting up all the environments in the terminal) so one needed to call a TA, which on the first day took like forever...\nThe first weeks were about Python, SQL, webscraping, and data science libraries. Nothing to scary, mostly very easy. So far nothing that was worth 8.5K.\nWhat I was really looking forward to was machine learning and deep learning. The machine learning weeks had good, but sometimes too easy tasks. Most of them \"stolen\" from a popular data-science book by Aurelien Geron which you can buy for about 70 Euros. The lectures were VERY mixed in terms of content quality. Some lecturers were ok, others really TERRIBLE. Sometimes I even skipped the lecture and read the chapter in the book by Geron. \nThe deep-learning weeks covered different architectures of neural nets, however only the most basic ones. Nothing up to date was covered, especially not Transformers, which is a pitty as this architecture is mostly used nowadays. So the deep-learning weeks were ok, but pretty basics. Here one sees, that the creators are not keeping up with trends... Also the creators decide to use TensorFlow library, which, I guess, has didactical reasons. However, nowadays mainly PyTorch is used... Also some of the teachers of the live session were not able to answer questions that went beyond the pre-recorded lecture; I had to research on my own...\nThe last part was about ML-Engineering. Most of the stuff was horrible because of the many difficulties in the tasks and how to solve certain problems so many students had. Also in the 24/7 some questions were not answered at all. Even when I used a ticket with a TA, he could not resolve the problem, also not a second TA...\nThe final project was ok, however two team members almost did nothing or didn't answer any questions.\nFinally and this is most important to my review: The career-week. It was a waste of time. The lectures didn't help at all and the connecting event with companies was a joke. One company was not present at all, the other company not hiring for Data Science, a small start up with 3 members without a businnes-plan, and another company which sounded extremly dubious. \nI wished they would worked together with companies throughout the whole bootcamp maybe already presenting problems from them, which you try to solve so that they can find potentially interesting people. The way Le Wagon is doing didn't work for me.\nI regret doing the bootcamp. You should better go for a university degree if you want to get a job in that related field (Data Science, Data Analytics, ML Engineer...)",
        "date": "15. Juli 2023"
    },
    {
        "country_code": "DE",
        "review": "Le Wagon est une très bonne formation, très intense où on apprend énormément de concepts et outils qui nous serviront tout au long de notre carrière. \nJe recommande vivement cette formation. Si c'était à refaire, je n'hésiterai pas.",
        "date": "08. September 2023"
    },
    {
        "country_code": "DE",
        "review": "I recently completed the Le Wagon Data Science bootcamp program in Cologne, and I have to say it was an incredible experience. The program was well-structured and taught by experts in the field who provided us with a comprehensive education in data science.\nWhat I loved most about the Data Science bootcamp was the emphasis on hands-on learning. Throughout the program, we worked on real-world data sets and projects, allowing us to apply our skills and knowledge to solve meaningful problems. The instructors were incredibly knowledgeable and always available to provide guidance and support.\nThe curriculum covered everything from data cleaning and analysis to machine learning and data visualization, and the instructors did a great job of breaking down complex topics into easily digestible concepts.\nThe bootcamp was also incredibly well-organized, with weekly events and networking opportunities that allowed us to connect with other students and industry professionals. This was a great way to build a network in the field and get insights into the industry.\nOverall, I would highly recommend the Le Wagon Data Science bootcamp program in Cologne to anyone looking to break into the field or further their education in data science. The program was well-designed, and the instructors were knowledgeable, supportive, and passionate about the subject matter. I feel confident in my ability to apply the skills I learned in my career, and I am grateful for the experience.",
        "date": "10. Oktober 2022"
    },
    {
        "country_code": "DE",
        "review": "I recently completed Le Wagon's data science bootcamp and I can confidently say that it was one of the best decisions I've made for my career. The program was incredibly well-structured and covered all the essential topics in data science, from programming in Python to machine learning algorithms and data visualization.\nThe instructors were knowledgeable, patient, and always willing to help us out whenever we had questions or got stuck on a problem. The curriculum was challenging, but the pace was manageable, and the exercises and projects were designed in such a way that we were able to apply what we learned in a real-world context.\nWhat I appreciated most about Le Wagon was the emphasis on collaboration and community. I had the opportunity to work with a diverse group of classmates from all over the world, and we formed strong bonds as we worked together to solve problems and build projects. The post-bootcamp support has also been fantastic, with access to job boards, alumni events, and continued support from the Le Wagon team.\nOverall, I would highly recommend Le Wagon's data science bootcamp to anyone looking to transition into a career in data science or upskill in this field. It was a challenging but incredibly rewarding experience, and I feel confident that I now have the skills and knowledge I need to succeed as a data scientist.",
        "date": "20. Oktober 2022"
    },
    {
        "country_code": "DE",
        "review": "Challenging, innovative, quick-paced and never boring - top notch. The Le Wagon team @Cologne-campus is delivering high-quality work. Be ready to move fast, explore new ideas and solve problems by experimental and especially try-and-error methods.",
        "date": "15. Dezember 2022"
    },
    {
        "country_code": "DE",
        "review": "Having been a little hesitant to choose the remote web development course, I must say that from day 1 these preconceptions were washed away. The pre-bootcamp course material really helped to get your mindset ready. There were definitely big learning curves throughout the process but I think all bootcamps have this intense experience. The staff were really friendly and inclusive, really making everyone in my large batch (50 of us!) feel comfortable whilst also pushing us to get as much as we could out of the learning environment. By choosing Ruby and Rails, the course is very focussed around full-stack so bear that in mind - all concepts are fundamentals to get a job as a frontend or backend engineer. Would definitely recommend the process.",
        "date": "05. Februar 2023"
    }
]